<?php

//Домашнее задание №7
//Создаем таблицу в HTML

echo "<table><tr>";

//Запускаем цикл
for ($i = 1; $i <= 10; $i++) {
    for ($j = 1; $j <= 10; $j++) {
        if ($i % 2 == 0 && $j % 2 == 0)
			// Четный
            echo "<td>" . '(' . ($j * $i) . ')' . "</td>";
        elseif ($i % 2 == 1 && $j % 2 == 1)
		// Нечетный
            echo "<td>" . '[' . ($j * $i) . ']' . "</td>";
        else
            echo "<td>" . ' ' . ($i * $j) . ' ' . "</td>";
    }
    if ($i != 10) echo "</tr><tr>";
}

//Закрываем таблицу на HTML
echo "</tr></table>";